{
  "story": {
    "start": {
      "text": "Select an avatar to begin your journey:",
      "choices": [
        {
          "text": "Man",
          "next": "symptoms"
        },
        {
          "text": "Woman",
          "next": "symptoms"
        },
        {
          "text": "Other",
          "next": "symptoms"
        }
      ]
    },
    "symptoms": {
      "text": "You have been feeling unwell recently, but have been unable to pinpoint your symptoms. You have been nursing a mild headache with some dizziness and fatigue.\n\n It's time to visit the clinic to understand what's going on. Click \"Next\" to proceed to the clinic.",
      "choices": [
        {
          "text": "Next",
          "next": "clinic"
        }
      ]
    },
    "clinic": {
      "text": "The doctor would like to take some basic vital signs. Your age can affect how the doctor chooses to measure your vitals. \n\nAre you over the age of 80?",
      "choices": [
        {
          "text": "Yes",
          "next": "bp_over_80"
        },
        {
          "text": "No",
          "next": "bp_under_80"
        }
      ]
    },
    "bp_over_80": {
      "text": "In patients of older ages, blood pressure can vary depending on the patient's resting position. \n\n To get a comprehensive understanding of your blood pressure, both sitting and standing measurements will be taken.",
      "choices": [
        {
          "text": "Measure sitting and standing blood pressure",
          "next": "bp"
        }
      ]
    },
    "bp_under_80": {
      "text": "At the clinic, your blood pressure will be measured. This initial test is essential for assessing your health status.",
      "choices": [
        {
          "text": "Measure blood pressure",
          "next": "bp"
        }
      ]
    },
    "bp": {
      "text": "Your blood pressure results came back with a systolic blood pressure reading of 142 mm Hg, indicating borderline hypertension.\n\n To explore your treatment options, we need to dive into your patient profile and medical history.",
      "choices": [
        {
          "text": "Next",
          "next": "diabetes"
        }
      ]
    },
    "diabetes": {
      "text": "Knowing your history of diabetes is crucial because it can influence the management of your hypertension.\n\n Are you diabetic? Suggestion: Flip a coin to decide your diabetes status 🪙.",
      "choices": [
        {
          "text": "Head",
          "next": "diabetes_yes"
        },
        {
          "text": "Tail",
          "next": "diabetes_no"
        }
      ]
    },
    "diabetes_yes": {
      "text": "You are diabetic. Hypertension affects 20-60% of patients with diabetes, and diabetic patients with hypertension are at particularly high risk of complications like heart attacks. As a result, your best option is to begin treatment right away to manage your blood pressure.\n\n Angiotensin converting enzyme inhibitors (ACEIs) are the first line of management of diabetic hypertensives, and your doctor will place you on that without undergoing further examination.",
      "choices": [
        {
          "text": "Treat with ACEi or ARB",
          "next": "summary"
        }
      ]
    },
    "diabetes_no": {
      "text": "You are not diabetic. That is cause for some relief. Diabetic patients with hypertension are at particularly high risk of complications like heart attacks.\n\n Moving on to your age: are you above the age of 40?",
      "choices": [
        {
          "text": "Yes",
          "next": "age_over_40"
        },
        {
          "text": "No",
          "next": "age_under_40"
        }
      ]
    },
    "age_under_40": {
      "text": "In young patients, hypertension might signal secondary causes rather than primary hypertension,which is more common in older adults.\n\n Because of your age, the doctor will need to conduct a comprehensive secondary cause assessment to uncover any underlying conditions such as kidney disease, hormonal disorders, or congenital heart defects that could be causing the elevated blood pressure. Early detection and treatment of these causes are crucial for preventing long-term health complications.\n\n Click \"Next\" to proceed through MRI and lab tests.",
      "choices": [
        {
          "text": "Next",
          "next": "diagnosis"
        }
      ]
    },
    "diagnosis": {
      "text": "Thankfully, everything is normal and these tests confirm that you are diagnosed with primary hypertension, which does not have a clear underlying cause but could be influenced by a combination of genetic factors, lifestyle choices, and environmental factors.",
      "choices": [
        {
          "text": "Next",
          "next": "age_over_40"
        }
      ]
    },
    "age_over_40": {
      "text": "Because of your age, it is likely that you have primary hypertension,which does not have a clear underlying cause but could be influenced by a combination of genetic factors, lifestyle choices, and environmental factors. \n\n It's now important to check for any damage to your organs that might have been caused by elevated blood pressure levels. \n\n Click \"Next\" to proceed through tests including echocardiograms to check for heart damage and chemistry tests to assess kidney health.",
      "choices": [
        {
          "text": "Next",
          "next": "organ_damage"
        }
      ]
    },
    "organ_damage": {
      "text": "Flip a coin to reveal the results of the organ damage tests 🪙.",
      "choices": [
        {
          "text": "Heads",
          "next": "organ_damage_yes"
        },
        {
          "text": "Tails",
          "next": "organ_damage_no"
        }
      ]
    },
    "organ_damage_no": {
      "text": "The tests have been completed and the good news is that they confirm you do not have any target organ damage. This is a positive sign for your health moving forward.\n\nAs one last check, have you had a recent ophthalmology assessment? It's important to check for signs of hypertensive eye disease. Flip a coin to decide 🪙.",
      "choices": [
        {
          "text": "Heads",
          "next": "ophthalmology_damage_yes"
        },
        {
          "text": "Tails",
          "next": "ophthalmology"
        }
      ]
    },
    "ophthalmology": {
      "text": "The doctor will perform an ophthalmology assessment to carefully check your eyes for any signs of damage caused by high blood pressure, ensuring your vision and eye health are safeguarded.\n\nDoes the assessment indicate hypertensive eye disease? Flip a coin to decide 🪙.",
      "choices": [
        {
          "text": "Head",
          "next": "ophthalmology_damage_yes"
        },
        {
          "text": "Tails",
          "next": "monitor_bp"
        }
      ]
    },
    "ophthalmology_damage_yes": {
      "text": " Your ophthalmology tests indicate indicate hypertensive eye disease, which means that one or more of your body's organs have been affected by high blood pressure. Because of this, you are at risk of health complications and you should undergo treatment right away to manage your hypertension effectively.",
      "choices": [
        {
          "text": "Treat right away",
          "next": "ancestry"
        }
      ]
    },
    "monitor_bp": {
      "text": "With no target organ damage and no hypertensive eye disease, your early diagnosis and mild hypertension indicates that regular blood pressure monitoring and lifestyle management may be a good approach to start with.\n\n Your blood pressure will be monitored continuously over the course of the next several weeks before treatment options are evaluated. \n\n However, the doctor will 'prescribe' lifestyle guidance to reduce salt intake, exercise regularly, and eat a healthy diet to see if this helps reduce your blood pressure over time.",
      "choices": [
        {
          "text": "Monitor BP, re-measure over 7 days",
          "next": "summary"
        }
      ]
    },
    "organ_damage_yes": {
      "text": " Tests indicate that one or more of your body's organs have been affected by high blood pressure. Because of this, you are at risk of health complications and you should undergo treatment right away to manage your hypertension effectively.",
      "choices": [
        {
          "text": "Treat right away",
          "next": "ancestry"
        }
      ]
    },
    "ancestry": {
      "text": "Individuals with certain ancestry backgrounds tend to respond differently to certain anti-hypertensive medications.\n\n Does your ancestry include African or Afro-Caribbean roots?",
      "choices": [
        {
          "text": "Yes",
          "next": "afrocaribean_ancestry_yes"
        },
        {
          "text": "No",
          "next": "afrocaribean_ancestry_no"
        }
      ]
    },
    "afrocaribean_ancestry_yes": {
      "text": "Clinical studies have shown that hypertensive patients of African or Afro-Caribbean ancestry respond well to Calcium Channel Blockers (CCBs) and this is recommended as initial treatment. \n\n The doctor will start you on CCBs alongside lifestyle guidelines to reduce salt intake, exercise regularly, and eat a healthy diet..",
      "choices": [
        {
          "text": "Treat with CCB",
          "next": "summary"
        }
      ]
    },
    "afrocaribean_ancestry_no": {
      "text": "Based on your profile, treating your hypertension with ACE inhibitors or Angiotensin II Receptor Blockers (ARBs) is recommended. \n\n Your doctor will start you on one of these alongside lifestyle guidelines to reduce salt intake, exercise regularly, and eat a healthy diet.",
      "choices": [
        {
          "text": "Treat with ACEi or ARB",
          "next": "summary"
        }
      ]
    },
    "summary": {
      "text": "Your data enter a biobank on hypertension in UK patients to enable future research. Depending on your risk profile and patient journey, you could be missing certain measurements that other hypertensive patients experienced in their journeys.\n\n Is it possible your data have contributed to \"structured missingness\" in the biobank database?",
      "choices": [
        {
          "text": "Next",
          "next": "end"
        }
      ]
    },
    "end": {
      "text": "Researchers at the Alan Turing Institute and Genentech/Roche are jointly working to better detect and resolve structured missingness in large, multi-modal health databases like the fictional biobank described in this demo.\n\n Researchers at Queen Mary University London and the University of Southampton are using graphical methods like \"networks\" and \"hyper-graphs\" to visualise and unravel the hidden structure of missing data in complex datasets. \n\n At UCL, a team is developing new mathematical theory to explain and find a solution to structured missing data.\n\n Scan the QR codes below to read the latest publications on this fascinating and complex topic!"
    }
  }
}
